000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ГруппыПолучателейСкидки/ГруппыПолучателейСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПолучателейСкидки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СпособФормирования</name>
    <type>
      <types>EnumRef.СпособыФормированияСегментов</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяШаблонаСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПолучателей</name>
    <type>
      <types>EnumRef.ТипыПолучателейСкидок</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СпособыФормированияСегментов/СпособыФормированияСегментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыФормированияСегментов</name>
  <enumValues>
    <name>ФормироватьДинамически</name>
  </enumValues>
  <enumValues>
    <name>ПериодическиОбновлять</name>
  </enumValues>
  <enumValues>
    <name>ФормироватьВручную</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыПолучателейСкидок/ТипыПолучателейСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПолучателейСкидок</name>
  <enumValues>
    <name>ФизическиеЛица</name>
  </enumValues>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>СмешанныйСписок</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ГруппыПолучателейСкидки/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	//установить ответственного по умолчанию
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

	//установить дату создания
	Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	//установить способ формирования
	Если НЕ ЗначениеЗаполнено(СпособФормирования) Тогда
		СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если ИмяШаблонаСКД = "ФизическиеЛица" Тогда
			ТипПолучателей = Перечисления.ТипыПолучателейСкидок.ФизическиеЛица;
		ИначеЕсли ИмяШаблонаСКД = "Контрагенты" Тогда
			ТипПолучателей = Перечисления.ТипыПолучателейСкидок.Контрагенты;
		Иначе
			ТипПолучателей = Перечисления.ТипыПолучателейСкидок.СмешанныйСписок;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
